---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarLayoutRule
source: html/bc9034d0-5055-c55e-2686-b221d156ed48.htm
---
# Autodesk.Revit.DB.Structure.RebarLayoutRule

The rule for how the rebars in rebar set are laid out

## Syntax (C#)
```csharp
public enum RebarLayoutRule
```